[
    {
        "DonorName": "Alice Smith",
        "DonorEmail": "alice.smith@example.com",
        "Location": "123 Elm Street, Cityville",
        "FoodImage": "https://insanelygoodrecipes.com/wp-content/uploads/2023/02/Raw_Red_Fuji_Apple_in_a_Basket.jpg",
        "FoodName": "Fresh Apples",
        "FoodQuantity": 10,
        "ExpiredDay": 5,
        "Status": 1,
        "DonorImage": "https://i.ibb.co/njD4mBM/user3.jpg",
        "Description": "A crate of delicious, freshly picked apples ready to be shared with the community.",
        "Details": "These fresh apples are sourced from local orchards known for their high-quality produce. Crisp and sweet, they are perfect for snacking, baking, or making fresh apple juice. Apples are a great source of essential nutrients and dietary fiber, making them a healthy addition to any meal. Whether you're making a classic apple pie or simply enjoying a nutritious snack, these apples will add a burst of flavor to your day."
    },
    {
        "DonorName": "John Doe",
        "DonorEmail": "john.doe@example.com",
        "Location": "456 Oak Avenue, Townsville",
        "FoodImage": "https://plantbasedjuniors.com/wp-content/uploads/2021/01/Canned-plant-based-foods1-scaled.jpg",
        "FoodName": "Canned Vegetables",
        "FoodQuantity": 20,
        "ExpiredDay": 7,
        "Status": 1,
        "DonorImage": "https://i.ibb.co/StZ0S0x/user1.jpg",
        "Description": "Assorted canned vegetables, perfect for creating hearty meals.",
        "Details": "This donation includes a variety of canned vegetables, such as corn, green beans, peas, and carrots. Canned vegetables are a convenient and nutritious addition to your pantry. They are great for making soups, stews, or side dishes. These vegetables were carefully selected and canned to preserve their freshness and flavor. With 20 cans in this donation, you'll have plenty of options for preparing delicious and healthy meals for your family."
    },
    {
        "DonorName": "Sarah Johnson",
        "DonorEmail": "sarah.johnson@example.com",
        "Location": "789 Maple Lane, Villageton",
        "FoodImage": "https://chatelaine.com/wp-content/uploads/2020/11/no-knead-bread-social-766x575.jpg",
        "FoodName": "Fresh Bread",
        "FoodQuantity": 5,
        "ExpiredDay": 7,
        "Status": 1,
        "DonorImage": "https://i.ibb.co/mRFn0g6/user2.jpg",
        "Description": "Homemade, freshly baked bread that's great for sandwiches and toast.",
        "Details": "Indulge in the comforting aroma of freshly baked bread with this donation. The bread is lovingly homemade by Sarah and comes in a variety of flavors, including whole wheat, sourdough, and classic white. It's perfect for making sandwiches, toasting with butter, or serving alongside your favorite soups and stews. Each loaf is crafted with care, ensuring a delicious and wholesome addition to your meals. With 5 loaves in this donation, you'll have plenty of bread to enjoy and share with your loved ones."
    },
    {
        "DonorName": "Michael Brown",
        "DonorEmail": "michael.brown@example.com",
        "Location": "101 Pine Road, Hamletsville",
        "FoodImage": "https://www.saskmade.ca/cdn/shop/products/PVF-fishpike_720x_422d8a90-0e9d-4d87-ae53-6d9aceb14955_800x.jpg",
        "FoodName": "Frozen Fish Fillets",
        "FoodQuantity": 15,
        "ExpiredDay": 10,
        "Status": 1,
        "DonorImage": "https://i.ibb.co/dD4fZVH/user4.jpg",
        "Description": "High-quality frozen fish fillets, perfect for seafood dishes.",
        "Details": "These frozen fish fillets are sourced from sustainable fisheries and are known for their high quality. They are ideal for preparing delicious seafood dishes such as baked fish, grilled fillets, or fish tacos. The fillets are individually vacuum-sealed to maintain their freshness and flavor. With 15 pounds of fish fillets in this donation, you can enjoy restaurant-quality seafood meals at home."
    },
    {
        "DonorName": "Emily Wilson",
        "DonorEmail": "emily.wilson@example.com",
        "Location": "222 Cedar Street, Riverside",
        "FoodImage": "https://s3.amazonaws.com/secretsaucefiles/photos/images/000/099/539/large/IMG_1555.jpg",
        "FoodName": "Canned Soup",
        "FoodQuantity": 30,
        "ExpiredDay": 6,
        "Status": 1,
        "DonorImage": "https://i.ibb.co/tBndvPN/user7.jpg",
        "Description": "A variety of canned soups, ideal for quick and warm meals.",
        "Details": "This donation includes a variety of canned soups, such as chicken noodle, tomato, and minestrone. Canned soups are a convenient and comforting option for quick and warm meals. They are perfect for lunch or dinner and can be enjoyed with a side of fresh bread or crackers. With 30 cans in this donation, you'll have plenty of options for creating hearty and delicious soups whenever you need them."
    },
    {
        "DonorName": "Robert Lee",
        "DonorEmail": "robert.lee@example.com",
        "Location": "333 Birch Drive, Groveton",
        "FoodImage": "https://www.world-grain.com/ext/resources/Article-Images/2019/08/Rice_AdobeStock_64819529_E.jpg",
        "FoodName": "Rice",
        "FoodQuantity": 10,
        "ExpiredDay": 7,
        "Status": 1,
        "DonorImage": "https://i.ibb.co/f85pvSY/user6.jpg",
        "Description": "High-quality rice, perfect for various dishes.",
        "Details": "This donation includes 10 pounds of high-quality rice, perfect for a wide range of dishes. Whether you're making a pilaf, risotto, or simply serving it as a side, this rice is versatile and delicious. It's known for its consistent quality and taste, making it a staple in many households. With this donation, you'll have a reliable source of rice to complement your meals."
    },
    {
        "DonorName": "Amanda White",
        "DonorEmail": "amanda.white@example.com",
        "Location": "444 Willow Lane, Woodsville",
        "FoodImage": "https://images.surferseo.art/b22dd690-c6fe-4d1b-978b-e1af00dc1491.jpeg",
        "FoodName": "Fresh Oranges",
        "FoodQuantity": 12,
        "ExpiredDay": 4,
        "Status": 1,
        "DonorImage": "https://i.ibb.co/ChrwzLT/user5.jpg",
        "Description": "Juicy and fresh oranges for a healthy snack.",
        "Details": "These fresh oranges are a burst of natural sweetness and vitamin C. Perfect for snacking, juicing, or adding a citrusy flavor to your dishes, they are a healthy and delicious option. Packed with essential nutrients, these oranges can boost your immune system and brighten your day. With 12 pounds of oranges in this donation, you'll have plenty to share with family and friends."
    },
    {
        "DonorName": "James Turner",
        "DonorEmail": "james.turner@example.com",
        "Location": "555 Redwood Avenue, Parkville",
        "FoodImage": "https://rainbowplantlife.com/wp-content/uploads/2021/06/sausage-pasta-lazy-meals-1-of-3-scaled.jpg",
        "FoodName": "Pasta",
        "FoodQuantity": 8,
        "ExpiredDay": 2,
        "Status": 1,
        "DonorImage": "https://i.ibb.co/njD4mBM/user3.jpg",
        "Description": "Assorted pasta, great for making delicious pasta dishes.",
        "Details": "This donation includes various types of pasta, such as spaghetti, penne, and farfalle. Pasta is a versatile and beloved staple that can be used in countless recipes. Whether you're making a classic spaghetti bolognese, a creamy Alfredo, or a pasta salad, these pasta options have you covered. With 8 pounds of pasta in this donation, you can explore a world of delicious pasta dishes."
    },
    {
        "DonorName": "Linda Hall",
        "DonorEmail": "linda.hall@example.com",
        "Location": "666 Cedar Street, Lakeside",
        "FoodImage": "https://www.foodrepublic.com/img/gallery/the-most-nutritious-way-to-buy-canned-fruit/l-intro-1688654231.jpg",
        "FoodName": "Canned Fruit",
        "FoodQuantity": 24,
        "ExpiredDay": 9,
        "Status": 1,
        "DonorImage": "https://i.ibb.co/tBndvPN/user7.jpg",
        "Description": "Canned fruits, perfect for snacks and desserts.",
        "Details": "This donation includes a variety of canned fruits, such as peaches, pears, and pineapple. Canned fruits are a convenient and delicious option for snacking and desserts. They retain their natural sweetness and are ideal for making fruit salads, parfaits, or simply enjoying as a treat. With 24 cans of canned fruits in this donation, you'll have a wide selection to satisfy your sweet cravings."
    },
    {
        "DonorName": "William Clark",
        "DonorEmail": "william.clark@example.com",
        "Location": "777 Elm Street, Riverdale",
        "FoodImage": "https://www.chequamegonfoodcoop.com/wp-content/uploads/2016/09/carrots-basket-vegetables-market-37641-1240x829.jpeg",
        "FoodName": "Fresh Carrots",
        "FoodQuantity": 8,
        "ExpiredDay": 5,
        "Status": 1,
        "DonorImage": "https://i.ibb.co/f85pvSY/user6.jpg",
        "Description": "Fresh and crunchy carrots, great for salads and cooking.",
        "Details": "These fresh carrots are known for their crispness and vibrant color. They are a versatile vegetable, perfect for adding to salads, roasting, or using as a side dish. Carrots are packed with vitamins and antioxidants, making them a nutritious addition to your meals. With 8 pounds of fresh carrots in this donation, you'll have plenty to use in your culinary creations."
    },
    {
        "DonorName": "Olivia Anderson",
        "DonorEmail": "olivia.anderson@example.com",
        "Location": "888 Pine Road, Hillside",
        "FoodImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2023/03/can-of-tuna.jpg",
        "FoodName": "Canned Tuna",
        "FoodQuantity": 15,
        "ExpiredDay": 3,
        "Status": 1,
        "DonorImage": "https://i.ibb.co/wMvdRtx/user5.jpg",
        "Description": "Canned tuna, perfect for making sandwiches and salads.",
        "Details": "This donation includes high-quality canned tuna packed in water. Canned tuna is a versatile protein source that can be used to make sandwiches, salads, and casseroles. It's a convenient and nutritious option for quick and delicious meals. With 15 cans of canned tuna in this donation, you'll have plenty to create your favorite tuna dishes."
    },
    {
        "DonorName": "Daniel Garcia",
        "DonorEmail": "daniel.garcia@example.com",
        "Location": "999 Birch Drive, Mountainview",
        "FoodImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/06/holding-bowl-fresh-tomatoes.jpg",
        "FoodName": "Fresh Tomatoes",
        "FoodQuantity": 7,
        "ExpiredDay": 7,
        "Status": 1,
        "DonorImage": "https://i.ibb.co/dD4fZVH/user4.jpg",
        "Description": "Ripe and fresh tomatoes, ideal for sauces and salads.",
        "Details": "These fresh tomatoes are plump and flavorful, perfect for creating sauces, salads, and various dishes. They are sourced from local farms known for their quality produce. Tomatoes are rich in vitamins and can enhance the flavor of your meals. With 7 pounds of fresh tomatoes in this donation, you'll have a key ingredient for your culinary adventures."
    }
]